       Dcl-s r_Lib_lot char( 50) Template;
       Dcl-s r_Nom_obj_IBMi Char(10) Template;
       Dcl-s r_Num_lot Bindec(9:0) Template;
       Dcl-s r_Num_lot_carac Char(6) Template;
